dominiczy/satelliteplatform/processors/msp430sc/msp430_isa.cpp
/******************************************************
 * Behavior implementation file template.             *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/

/**
 * @file   msp430_isa.cpp
 * @author Rogerio Paludo <rogerio.pld@gmail.com> 
 * @date   Thu Jan 29 22:29:20 2015
 * 
 * @author Dominic Zijlstra <dominiczijlstra@gmail.com> 
 * @date   Mon Jun 1 13:29:20 2015
 *
 * @brief  In this is file is implemented all the instructions behavior
 * 
 * @todo Testing
 */

#include  "msp430_isa.H"
#include  "msp430_isa_init.cpp"
#include  "msp430_bhv_macros.H"
#include  "msp430_global.cpp"
#include  "methdoins.cpp"
#include <unistd.h>

/// 'using namespace' statement to allow access to all msp430-specific datatypes
using namespace msp430_parms;

//********************************************************************
// Methods
//********************************************************************
/** 
 * This function is called when there is a constant involved 
 * 
 * @param sreg source register
 * @param as addressing field used for the source
 * @param constant structure constant (contains value and mode)
 * 
 * @return a structure cnt
 */
inline cnt Const(int sreg, int as, cnt constant) {	
  if (sreg == SR && (as == 2 || as == 3) || sreg == 3) {
    constant.mode = true;		
    switch (as) {
    case 0: if (sreg == 3) constant.value = 0; break;
    case 1: if (sreg == 3) constant.value = 1; break;
    case 2: constant.value = ((sreg == 3) ? 2 : 4); break;
    case 3: constant.value = ((sreg == 3) ? -1 : 8); break;
    }
  }
  return constant;	
}
//********************************************************************
// Behavior
//********************************************************************

//extern sc_event interruptevent; //extern interruptevent

//!Behavior executed before simulation begins.
void ac_behavior( begin ){
  //printf("Please enter the start address of the instruction memory\n");
  //uint16_t address;
  //cin >> hex >> address;
  RB.write(PC, 0x1100);//0x1100);
  RB.write(SR, 0);
};

//!Behavior executed after simulation ends.
void ac_behavior( end ){};

//!Generic instruction behavior method.
void ac_behavior( instruction ){
  dbg_printf("%s - PC=%#x ----- %lld\n", (sc_core::sc_get_current_process_b()->get_parent()->name()), (int) RB.read(PC), ac_instr_counter); 	
  dbg_printf("%s - size: %u \n", (sc_core::sc_get_current_process_b()->get_parent()->name()), get_size());
	
  // Update flags from status register
  flags.N = (RB.read(SR) & 0x4) ? true : false;
  flags.Z = (RB.read(SR) & 0x2) ? true : false;
  flags.C = (RB.read(SR) & 0x1) ? true : false;
  flags.V = (RB.read(SR) & 0x100) ? true : false;  
  dbg_printf("%s - SR=0x%X ----- \n", (sc_core::sc_get_current_process_b()->get_parent()->name()), RB.read(SR)); 

 /* // Low power mode	
  while ( (getBit(RB.read(SR), 3)) & (getBit(RB.read(SR), 4)) ) {
		dbg_printf("%s - wait for interrupt - PC=0x%X \n", (sc_core::sc_get_current_process_b()->get_parent()->name()),RB.read(PC));
		wait(interruptevent);  // wait for interrupt
		if (!( (getBit(RB.read(SR), 3)) & (getBit(RB.read(SR), 4)) ) ) {
			dbg_printf("%s - interrupt happened - PC=0x%X \n", (sc_core::sc_get_current_process_b()->get_parent()->name()),RB.read(PC));
			ac_annul(); // cancel current instruction
		}
	}*/
  
  // Test CPUOFF bit
  if (getBit(RB.read(SR), 4)) {
    	dbg_printf("CPUOFF bit 0x%X\n", getBit(RB.read(SR), 4));
   	stop();
  }
};
 
// Instruction Format behavior methods.

// ******************DOUBLE******************
/// 48 bits double operand instruction generic behavior
void ac_behavior( Double_48 ){
  dbg_printf("inst:-> %s op:%d, sreg:%d, ad:%d, bw:%d, as:%d, dreg:%d, osrc:0x%X, odst:0x%X\n",
	     get_name(), op, sreg, ad, bw, as, dreg, osrc, odst);

  // Constant generator
  constant = Const(sreg, as, constant);
 
  // Update Program Counter
  // conditional increment
  if (constant.mode) {
    RB.write(PC, RB.read(PC) + 4);
    ac_pc = RB.read(PC);
  } else {
    RB.write(PC, RB.read(PC) + get_size());
    ac_pc = RB.read(PC);
  }
}
/// 32 bits double operand instruction generic behavior
void ac_behavior( Double_32 ){
  dbg_printf("inst:-> %s op:%d, sreg:%d, ad:%d, bw:%d, as:%d, dreg:%d, oset:0x%X\n",
	     get_name(), op, sreg, ad, bw, as, dreg, oset);
  
  // Constant generator
  constant = Const(sreg, as, constant);	

  // Update Program Counter
  // conditional increment
  if (constant.mode && ad == 0) {
    RB.write(PC, RB.read(PC) + 2);
    ac_pc = RB.read(PC);
  } else {
    RB.write(PC, RB.read(PC) + get_size());
    ac_pc = RB.read(PC);
  }
}
/// 16 bits double operand instruction generic behavior
void ac_behavior( Double ){
  dbg_printf("inst:-> %s op:%d, sreg:%d, ad:%d, bw:%d, as:%d, dreg:%d\n",
	     get_name(), op, sreg, ad, bw, as, dreg);
  // Constant generator
  constant = Const(sreg, as, constant);	
	
  // update PC
  RB.write(PC, RB.read(PC) + get_size());
  ac_pc = RB.read(PC);
}

// ******************SINGLE******************
///  32 bits single operand instruction generic behavior
void ac_behavior( Single_32 ){
  dbg_printf("inst:-> %s op:%d, bw:%d, as:%d, sreg:%d, oset:0x%X\n",
	     get_name(), op, bw, as, sreg, oset);
	
	// Constant generator
  constant = Const(sreg, as, constant);	

  // update PC
  RB.write(PC, RB.read(PC) + get_size());
  ac_pc = RB.read(PC);
}
/// 16 bits single operand instruction generic behavior
void ac_behavior( Single ){
  dbg_printf("inst:-> %s op:%d, bw:%d, as:%d, sreg:%d\n",
     get_name(), op, bw, as, sreg);

	// Constant generator
  constant = Const(sreg, as, constant);	
	
