dominiczy/satelliteplatform/processors/msp430sc/msp430_isa.cpp
  // update PC
  RB.write(PC, RB.read(PC) + get_size());
  ac_pc = RB.read(PC);
}

// ******************JUMP******************
/// Jump instruction generic behavior
void ac_behavior( Jump ){
  dbg_printf("inst:-> %s op:%d, c:%d, offset:%d\n",
	     get_name(), opc, c, offset);
	
  // update PC
  RB.write(PC, RB.read(PC) + get_size());
  ac_pc = RB.read(PC);
}

//*****************************************************
// Instructions
//*****************************************************

/**
 * 
 * @defgroup DOUBLE DOUBLE operand instructions 
 * 
 * @brief All the double operand instruction 
 * @{ 
 */
//*****************************************************
// Double
//*****************************************************

/**
 * 
 * @defgroup MOV MOV instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//!Instruction mov_16rm behavior method.
void ac_behavior( mov_16rm ){
  mode = _16rm;
  MOV(sreg, bw, as, dreg, 0, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_16irm behavior method.
void ac_behavior( mov_16irm ){
  mode = _16irm;
  MOV(sreg, bw, as, dreg, 0, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_16iaim behavior method.
void ac_behavior( mov_16iaim ){
  mode = _16iaim;
  MOV(sreg, bw, as, dreg, 0, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_32idst behavior method.
void ac_behavior( mov_32idst ){
  mode = _32idst;
	 if (dreg != 2) 
    oset = (uint16_t)(oset + RB.read(dreg));
  MOV(sreg, bw, as, dreg, oset, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_32isrc behavior method.
void ac_behavior( mov_32isrc ){
  mode = _32isrc;
  if (sreg != 2) 
    oset = (uint16_t)(oset + RB.read(sreg));
  MOV(sreg, bw, as, dreg, oset, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_32imm behavior method.
void ac_behavior( mov_32imm ){
  mode = _32imm;
  MOV(sreg, bw, as, dreg, oset, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_32iaim behavior method.
void ac_behavior( mov_32iaim ){
  mode = _32iaim;
  if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  MOV(sreg, bw, as, dreg, oset, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_32irm behavior method.
void ac_behavior( mov_32irm ){
  mode = _32irm;
  if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  MOV(sreg, bw, as, dreg, oset, 0, 0, DM, RB, ac_pc);
}

//!Instruction mov_48idm behavior method.
void ac_behavior( mov_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }
  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);
  
  if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }
  MOV(sreg, bw, as, dreg, 0, osrc, odst, DM, RB, ac_pc);  
}

//!Instruction mov_48imm behavior method.
void ac_behavior( mov_48imm ){
  mode = _48imm;
  if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  MOV(sreg, bw, as, dreg, 0, osrc, odst, DM, RB, ac_pc);
}
//@}

/**
 * 
 * @defgroup ADD ADD instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** ADD ***********************
//!Instruction add_16rm behavior method.
void ac_behavior( add_16rm ){
  mode = _16rm;
  ADD(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction add_16irm behavior method.
void ac_behavior( add_16irm ){
  mode = _16irm;
  ADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction add_16iaim behavior method.
void ac_behavior( add_16iaim ){
  mode = _16iaim;
  ADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction add_32idst behavior method.
void ac_behavior( add_32idst ){
  mode = _32idst;
  if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  ADD(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction add_32isrc behavior method.
void ac_behavior( add_32isrc ){
  mode = _32isrc;
   if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
   dbg_printf("oset: 0x%X \n", (uint16_t)oset);
  ADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction add_32imm behavior method.
void ac_behavior( add_32imm ){
  mode = _32imm;
  ADD(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction add_32iaim behavior method.
void ac_behavior( add_32iaim ){
  mode = _32iaim;
   if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  ADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction add_32irm behavior method.
void ac_behavior( add_32irm ){
  mode = _32irm;
  if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  ADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction add_48idm behavior method.
void ac_behavior( add_48idm ) {
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }
  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

   if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }

  ADD(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));  
}

//!Instruction add_48imm behavior method.
void ac_behavior( add_48imm ){
  mode = _48imm;
  if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  ADD(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup ADDC ADDC instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** ADDC ************************
//!Instruction addc_16rm behavior method.
void ac_behavior( addc_16rm ){
  mode = _16rm;
  ADDC(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction addc_16irm behavior method.
void ac_behavior( addc_16irm ){
  mode = _16irm;
  ADDC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction addc_16iaim behavior method.
void ac_behavior( addc_16iaim ){
  mode = _16iaim;
  ADDC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction addc_32idst behavior method.
void ac_behavior( addc_32idst ){
  mode = _32idst;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  ADDC(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

