dominiczy/satelliteplatform/processors/msp430sc/msp430_isa.cpp
//!Instruction addc_32isrc behavior method.
void ac_behavior( addc_32isrc ){
  mode = _32isrc;
	 if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  ADDC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction addc_32imm behavior method.
void ac_behavior( addc_32imm ){
  mode = _32imm;
  ADDC(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction addc_32iaim behavior method.
void ac_behavior( addc_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  ADDC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction addc_32irm behavior method.
void ac_behavior( addc_32irm ){
  mode = _32irm;
	 if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  ADDC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction addc_48idm behavior method.
void ac_behavior( addc_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }
  
  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

   if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }
  
  ADDC(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction addc_48imm behavior method.
void ac_behavior( addc_48imm ){
  mode = _48imm;
	 if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  ADDC(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup AND AND instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** AND ************************
//!Instruction and_16rm behavior method.
void ac_behavior( and_16rm ){
  mode = _16rm;
  AND(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction and_16irm behavior method.
void ac_behavior( and_16irm ){
  mode = _16irm;
  AND(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction and_16iaim behavior method.
void ac_behavior( and_16iaim ){
  mode = _16iaim;
  AND(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction and_32idst behavior method.
void ac_behavior( and_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  AND(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction and_32isrc behavior method.
void ac_behavior( and_32isrc ){
  mode = _32isrc;
	 if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  AND(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction and_32imm behavior method.
void ac_behavior( and_32imm ){
  mode = _32imm;
  AND(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction and_32iaim behavior method.
void ac_behavior( and_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  AND(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction and_32irm behavior method.
void ac_behavior( and_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  AND(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction and_48idm behavior method.
void ac_behavior( and_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

   if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }
  
  AND(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction and_48imm behavior method.
void ac_behavior( and_48imm ){
  mode = _48imm;
	 if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  AND(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup BIC BIC instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** BIC ************************
//!Instruction bic_16rm behavior method.
void ac_behavior( bic_16rm ){
  mode = _16rm;
  BIC(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction bic_16irm behavior method.
void ac_behavior( bic_16irm ){
  mode = _16irm;
  BIC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction bic_16iaim behavior method.
void ac_behavior( bic_16iaim ){
  mode = _16iaim;
  BIC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction bic_32idst behavior method.
void ac_behavior( bic_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  BIC(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction bic_32isrc behavior method.
void ac_behavior( bic_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  BIC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction bic_32imm behavior method.
void ac_behavior( bic_32imm ){
  mode = _32imm;
  BIC(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction bic_32iaim behavior method.
void ac_behavior( bic_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  BIC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

