dominiczy/satelliteplatform/processors/msp430sc/msp430_isa.cpp
//!Instruction cmp_16iaim behavior method.
void ac_behavior( cmp_16iaim ){
  mode = _16iaim;
  CMP(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction cmp_32idst behavior method.
void ac_behavior( cmp_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction cmp_32isrc behavior method.
void ac_behavior( cmp_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction cmp_32imm behavior method.
void ac_behavior( cmp_32imm ){
  mode = _32imm;
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction cmp_32iaim behavior method.
void ac_behavior( cmp_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction cmp_32irm behavior method.
void ac_behavior( cmp_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  CMP(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction cmp_48idm behavior method.
void ac_behavior( cmp_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }    
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }
  CMP(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction cmp_48imm behavior method.
void ac_behavior( cmp_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  CMP(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup DADD DADD instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** DADD ************************
//!Instruction dadd_16rm behavior method.
void ac_behavior( dadd_16rm ){
  mode = _16rm;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction dadd_16irm behavior method.
void ac_behavior( dadd_16irm ){
  mode = _16irm;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction dadd_16iaim behavior method.
void ac_behavior( dadd_16iaim ){
  mode = _16iaim;
  DADD(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction dadd_32idst behavior method.
void ac_behavior( dadd_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction dadd_32isrc behavior method.
void ac_behavior( dadd_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction dadd_32imm behavior method.
void ac_behavior( dadd_32imm ){
  mode = _32imm;
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction dadd_32iaim behavior method.
void ac_behavior( dadd_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction dadd_32irm behavior method.
void ac_behavior( dadd_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  DADD(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction dadd_48idm behavior method.
void ac_behavior( dadd_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }

  DADD(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction dadd_48imm behavior method.
void ac_behavior( dadd_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  DADD(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup SUB SUB instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** SUB ************************
//!Instruction sub_16rm behavior method.
void ac_behavior( sub_16rm ){
  mode = _16rm;
  SUB(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction sub_16irm behavior method.
void ac_behavior( sub_16irm ){
  mode = _16irm;
  SUB(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction sub_16iaim behavior method.
void ac_behavior( sub_16iaim ){
  mode = _16iaim;
  SUB(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction sub_32idst behavior method.
void ac_behavior( sub_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  SUB(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction sub_32isrc behavior method.
void ac_behavior( sub_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  SUB(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction sub_32imm behavior method.
void ac_behavior( sub_32imm ){
  mode = _32imm;
  SUB(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction sub_32iaim behavior method.
void ac_behavior( sub_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  SUB(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction sub_32irm behavior method.
void ac_behavior( sub_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  SUB(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

