dominiczy/satelliteplatform/processors/msp430sc/msp430_isa.cpp
//!Instruction sub_48idm behavior method.
void ac_behavior( sub_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

   if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }

  SUB(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction sub_48imm behavior method.
void ac_behavior( sub_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  SUB(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup SUBC SUBC instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** SUBC ************************
//!Instruction subc_16rm behavior method.
void ac_behavior( subc_16rm ){
  mode = _16rm;
  SUBC(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction subc_16irm behavior method.
void ac_behavior( subc_16irm ){
  mode = _16irm;
  SUBC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction subc_16iaim behavior method.
void ac_behavior( subc_16iaim ){
  mode = _16iaim;
  SUBC(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction subc_32idst behavior method.
void ac_behavior( subc_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  SUBC(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction subc_32isrc behavior method.
void ac_behavior( subc_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  SUBC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction subc_32imm behavior method.
void ac_behavior( subc_32imm ){
  mode = _32imm;
  SUBC(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction subc_32iaim behavior method.
void ac_behavior( subc_32iaim ){
  mode = _32iaim;
	if (dreg != 2)
     oset = (uint16_t)(oset + RB.read(dreg));
  SUBC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction subc_32irm behavior method.
void ac_behavior( subc_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  SUBC(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction subc_48idm behavior method.
void ac_behavior( subc_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }
  
  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);

  if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }

  SUBC(sreg, bw, dreg, 0, osrc, odst, DM, RB, DM.read(osrc), DM.read(odst));
}

//!Instruction subc_48imm behavior method.
void ac_behavior( subc_48imm ){
  mode = _48imm;
	if (dreg != 2)
    odst = (uint16_t)(odst + RB.read(dreg));
  SUBC(sreg, bw, dreg, 0, osrc, odst, DM, RB, osrc, DM.read(odst));
}
//@}

/**
 * 
 * @defgroup XOR XOR instruction 
 * 
 * @brief group for all addressing modes
 * @{ 
 */
//****************** XOR ************************
//!Instruction xor_16rm behavior method.
void ac_behavior( xor_16rm ){
  mode = _16rm;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, RB.read(sreg), RB.read(dreg));
}

//!Instruction xor_16irm behavior method.
void ac_behavior( xor_16irm ){
  mode = _16irm;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction xor_16iaim behavior method.
void ac_behavior( xor_16iaim ){
  mode = _16iaim;
  XOR(sreg, bw, dreg, 0, 0, 0, DM, RB, DM.read(RB.read(sreg)), RB.read(dreg));
}

//!Instruction xor_32idst behavior method.
void ac_behavior( xor_32idst ){
  mode = _32idst;
		if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, RB.read(sreg), DM.read(oset));
}

//!Instruction xor_32isrc behavior method.
void ac_behavior( xor_32isrc ){
  mode = _32isrc;
	if (sreg != 2) // then whe are not in the absolute mode for source
    oset = (uint16_t)(oset + RB.read(sreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(oset), RB.read(dreg));
}

//!Instruction xor_32imm behavior method.
void ac_behavior( xor_32imm ){
  mode = _32imm;
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, oset, RB.read(dreg));
}

//!Instruction xor_32iaim behavior method.
void ac_behavior( xor_32iaim ){
  mode = _32iaim;
  if (dreg != 2) 
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction xor_32irm behavior method.
void ac_behavior( xor_32irm ){
  mode = _32irm;
	if (dreg != 2)
    oset = (uint16_t)(oset + RB.read(dreg));
  XOR(sreg, bw, dreg, oset, 0, 0, DM, RB, DM.read(RB.read(sreg)), DM.read(oset));
}

//!Instruction xor_48idm behavior method.
void ac_behavior( xor_48idm ){
  mode = _48idm;
  if ((sreg != SR && dreg != SR)) {// then we are using indexed mode
    if (constant.mode) 
      odst = (uint16_t)(osrc + RB.read(dreg));
    else {
      odst = (uint16_t)(odst + RB.read(dreg));
      osrc = (uint16_t)(osrc + RB.read(sreg));
    }
  }

  if (constant.mode && dreg == SR)
    odst = (uint16_t)(osrc);
  
 if ((!constant.mode)&& !((sreg != SR && dreg != SR))) {
    if ((dreg != SR) && (ad == 1))
      odst = (uint16_t)(odst + RB.read(dreg));
    else if ((sreg != SR) && (as == 1))
      osrc = (uint16_t)(osrc + RB.read(sreg));
   }

